RayGA17/Bambu-Progress-Bar/Esp8266/v3.2.cpp
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <WiFiManager.h>
#include <ESP8266WebServer.h>
#include <PubSubClient.h>
#include <Adafruit_NeoPixel.h>
#include <ArduinoJson.h>
#include <LittleFS.h>
#include <WiFiClientSecure.h>
#include <time.h>
#include <Ticker.h>

// LED 灯带配置
#define LED_PIN D4
#define LED_COUNT 20
Adafruit_NeoPixel strip(LED_COUNT, LED_PIN, NEO_GRB + NEO_KHZ800);

// MQTT 服务器配置
const char* mqttServer = "cn.mqtt.bambulab.com";
const int mqttPort = 8883;

// 全局对象
WiFiManager wm;
ESP8266WebServer server(80);
WiFiClientSecure espClient;
PubSubClient mqttClient(espClient);
Ticker watchdogTicker;

// 配置变量
char uid[32] = "";
char accessToken[256] = "";
char deviceID[32] = "";
int globalBrightness = 50;
char standbyMode[10] = "marquee";
bool overlayMarquee = false;
uint32_t progressBarColor = strip.Color(0, 255, 0); // 绿色
uint32_t standbyBreathingColor = strip.Color(0, 0, 255); // 蓝色
float progressBarBrightnessRatio = 1.0;
float standbyBrightnessRatio = 1.0;
unsigned long customPushallInterval = 30; // 自定义 pushall 间隔（秒）
String mqttTopicSub = "device/{DEVICE_ID}/report";
String mqttTopicPub = "device/{DEVICE_ID}/request";

// 时间控制
unsigned long lastReconnectAttempt = 0;
const long reconnectInterval = 5000;
unsigned long lastWiFiCheck = 0;
const long wifiCheckInterval = 10000;
unsigned long lastPushallTime = 0;
unsigned long lastOperationCheck = 0;
const long operationCheckInterval = 5000;
unsigned long lastHeapWarningTime = 0; // 堆内存警告时间戳
unsigned long webResponseStartTime = 0; // Web 响应开始时间
unsigned long lastMqttResponseTime = 0; // 最后一次 MQTT 响应时间
const long mqttResponseTimeout = 60000; // 60秒 MQTT 响应超时
const long webResponseTimeout = 20000; // 20秒 Web 响应超时
bool isWebServing = false; // 是否正在处理 Web 请求
bool pendingPushall = false; // 是否有暂停的全量包请求
bool printerOffline = false; // 打印机是否离线

// LED 动画控制
unsigned long lastLedUpdate = 0;
const long ledUpdateInterval = 33;
int marqueePosition = 0;
bool apClientConnected = false;
bool pauseLedUpdate = false; // 暂停 LED 更新

// LED 测试状态机
bool testingLed = false;
int testLedIndex = 0;
unsigned long lastTestLedUpdate = 0;
const long testLedInterval = 50;

// 单设备 Web 访问控制
IPAddress activeClientIP(0, 0, 0, 0);
unsigned long activeClientTimeout = 0;
const long clientTimeoutInterval = 60000;

// 状态枚举
enum State {
  AP_MODE,
  CONNECTING_WIFI,
  CONNECTED_WIFI,
  CONNECTING_PRINTER,
  CONNECTED_PRINTER,
  PRINTING,
  ERROR
};
State currentState = AP_MODE;
State lastState = AP_MODE;
int printPercent = 0;
String gcodeState = "";
String mqttError = "";
int remainingTime = 0;
int layerNum = 0;

// 强制模式控制
enum ForcedMode {
  NONE,
  PROGRESS,
  STANDBY
};
ForcedMode forcedMode = NONE;

// 全局打印机状态存储
StaticJsonDocument<1024> printerState;

// 看门狗变量
volatile bool watchdogTriggered = false;
unsigned long lastWatchdogFeed = 0;
const long watchdogTimeout = 15000;
unsigned long lastLedProcessTime = 0;
unsigned long lastModeJudgmentTime = 0;

// 函数声明
void configModeCallback(WiFiManager *myWiFiManager);
void saveConfigCallback();
void loadConfig();
void saveConfig();
void reconnectMQTT();
void mqttCallback(char* topic, byte* payload, unsigned int length);
void sendPushall();
uint32_t getRainbowColor(float position);
void updateLED();
void updateTestLed();
bool checkClientAccess();
void handleRoot();
void handleConfig();
void handleTestLed();
void handleLog();
void handleClearCache();
void handleResetConfig();
void handleSwitchMode();
bool isConfigValid();
bool isPrinting();
void watchdogCallback();
void sendFileInChunks(const char* filepath);

// 初始化静态 HTML 文件
void initStaticHtml() {
  File file = LittleFS.open("/index.html", "w");
  if (!file) {
    Serial.println("无法创建 /index.html");
    return;
  }
  String html = F("<!DOCTYPE html><html lang='zh-CN'><head><meta charset='UTF-8'>"
                  "<meta name='viewport' content='width=device-width, initial-scale=1.0'>"
                  "<title>打印机状态显示</title>"
                  "<style>"
                  "body { font-family: 'PingFang SC', Arial, sans-serif; margin: 20px; background-color: #f4f4f4; }"
                  "h1 { color: #333; }"
                  ".container { max-width: 600px; margin: auto; background: #fff; padding: 20px; border-radius: 8px; box-shadow: 0 2px 4px rgba(0,0,0,0.1); }"
                  "label { display: block; margin: 10px 0 5px; color: #555; }"
                  "input, select { width: 100%; padding: 8px; margin-bottom: 10px; border: 1px solid #ccc; border-radius: 4px; }"
                  "button { background-color: #007bff; color: white; padding: 10px 15px; border: none; border-radius: 4px; cursor: pointer; }"
                  "button:hover { background-color: #0056b3; }"
                  ".log { margin-top: 20px; padding: 10px; background: #e9ecef; border-radius: 4px; white-space: pre-wrap; }"
                  "</style>"
                  "<script>"
                  "function validateForm() {"
                  "  var uid = document.forms['configForm']['uid'].value;"
                  "  var accessToken = document.forms['configForm']['accessToken'].value;"
                  "  var deviceID = document.forms['configForm']['deviceID'].value;"
                  "  if (!uid.trim() || !accessToken.trim() || !deviceID.trim()) {"
                  "    alert('用户ID、访问令牌和设备序列号不能为空！');"
                  "    return false;"
                  "  }"
                  "  var brightness = parseInt(document.forms['configForm']['brightness'].value);"
                  "  if (isNaN(brightness) || brightness < 0 || brightness > 255) {"
                  "    alert('全局亮度必须在 0 到 255 之间！');"
                  "    return false;"
                  "  }"
                  "  var pbr = parseFloat(document.forms['configForm']['progressBarBrightnessRatio'].value);"
                  "  var sbr = parseFloat(document.forms['configForm']['standbyBrightnessRatio'].value);"
                  "  if (isNaN(pbr) || pbr < 0 || pbr > 1 || isNaN(sbr) || sbr < 0 || sbr > 1) {"
                  "    alert('亮度比例必须在 0 到 1 之间！');"
                  "    return false;"
                  "  }"
                  "  var pushallInterval = parseInt(document.forms['configForm']['customPushallInterval'].value);"
                  "  if (isNaN(pushallInterval) || pushallInterval < 10 || pushallInterval > 600) {"
                  "    alert('全量包请求间隔必须在 10 到 600 秒之间！');"
                  "    return false;"
                  "  }"
                  "  var pbc = document.forms['configForm']['progressBarColor'].value;"
                  "  var sbc = document.forms['configForm']['standbyBreathingColor'].value;"
                  "  if (!/^#[0-9A-Fa-f]{6}$/.test(pbc) || !/^#[0-9A-Fa-f]{6}$/.test(sbc)) {"
                  "    alert('颜色值必须是有效的 6 位十六进制颜色代码！');"
                  "    return false;"
                  "  }"
                  "  return true;"
                  "}"
                  "function updateLog() {"
                  "  var xhr = new XMLHttpRequest();"
                  "  xhr.open('GET', '/log', true);"
                  "  xhr.onreadystatechange = function() {"
                  "    if (xhr.readyState == 4 && xhr.status == 200) {"
                  "      document.getElementById('log').innerHTML = xhr.responseText;"
                  "    }"
                  "  };"
                  "  xhr.send();"
                  "}"
                  "setInterval(updateLog, 5000);"
                  "</script></head><body>"
                  "<div class='container'>"
                  "<h1>打印机状态显示</h1>"
                  "<p>设备状态：{STATE}</p>"
                  "<form name='configForm' action='/config' method='POST' onsubmit='return validateForm()'>"
                  "<label>用户ID：<input type='text' name='uid' value='{UID}'></label>"
                  "<label>访问令牌：<input type='text' name='accessToken' value='{ACCESSTOKEN}' maxlength='256'></label>"
                  "<label>设备序列号：<input type='text' name='deviceID' value='{DEVICEID}'></label>"
                  "<label>全局亮度（0-255）：<input type='number' name='brightness' min='0' max='255' value='{BRIGHTNESS}'></label>"
                  "<label>待机模式：<select name='standbyMode'>"
                  "<option value='marquee' {MARQUEE_SELECTED}>彩虹跑马灯</option>"
                  "<option value='breathing' {BREATHING_SELECTED}>呼吸灯</option>"
                  "</select></label>"
                  "<label>进度条颜色：<input type='color' name='progressBarColor' value='{PROGRESSBARCOLOR}'></label>"
                  "<label>待机呼吸灯颜色：<input type='color' name='standbyBreathingColor' value='{STANDBYBREATHINGCOLOR}'></label>"
                  "<label>进度条亮度比例（0.0-1.0）：<input type='number' step='0.1' min='0' max='1' name='progressBarBrightnessRatio' value='{PROGRESSBARBRIGHTNESSRATIO}'></label>"
                  "<label>待机亮度比例（0.0-1.0）：<input type='number' step='0.1' min='0' max='1' name='standbyBrightnessRatio' value='{STANDBYBRIGHTNESSRATIO}'></label>"
                  "<label>全量包请求间隔（10-600秒）：<input type='number' name='customPushallInterval' min='10' max='600' value='{CUSTOMPUSHALLINTERVAL}'></label>"
                  "<label><input type='checkbox' name='overlayMarquee' {OVERLAYMARQUEE_CHECKED}> 在进度条上叠加跑马灯</label>"
                  "<button type='submit'>保存配置</button>"
                  "</form>"
                  "<form action='/testLed' method='POST'><button type='submit'>测试 LED 灯带</button></form>"
                  "<form action='/clearCache' method='POST'><button type='submit'>清除缓存</button></form>"
                  "<form action='/resetConfig' method='POST'><button type='submit'>重置配置</button></form>"
                  "<form action='/switchMode' method='POST'>"
                  "<label>切换到：<select name='mode'>"
                  "<option value='progress'>进度条</option>"
                  "<option value='standby'>待机</option>"
                  "</select></label><button type='submit'>切换模式</button></form>"
                  "<div class='log' id='log'>正在加载日志...</div></div>"
                  "<script>updateLog();</script></body></html>");
  file.print(html);
  file.close();
  Serial.println("静态 HTML 文件已写入 /index.html");
}

// 分块发送文件
void sendFileInChunks(const char* filepath) {
  File file = LittleFS.open(filepath, "r");
  if (!file) {
    server.send(500, "text/plain", "无法打开文件");
    isWebServing = false;
    pauseLedUpdate = false;
    return;
  }

  size_t fileSize = file.size();
  size_t chunkSize = 512; // 默认块大小
  if (ESP.getFreeHeap() < 10000) {
    chunkSize = min(chunkSize, ESP.getFreeHeap() / 2); // 根据剩余内存调整
  }

  server.setContentLength(fileSize);
  server.send(200, "text/html; charset=utf-8", "");

  char buffer[512];
  while (file.available()) {
    size_t bytesRead = file.readBytes(buffer, min(chunkSize, static_cast<size_t>(file.available())));
    server.client().write(buffer, bytesRead);
    yield(); // 防止看门狗触发
  }

  file.close();
  isWebServing = false;
  pauseLedUpdate = false;
  if (pendingPushall) {
    sendPushall();
    pendingPushall = false;
  }
}

