RayGA17/Bambu-Progress-Bar/Esp8266/v3.2.cpp
// 看门狗中断处理
void watchdogCallback() {
  unsigned long currentMillis = millis();
  
  if (!isWebServing) {
    if (lastLedProcessTime > 0 && currentMillis - lastLedProcessTime > watchdogTimeout) {
      Serial.println("看门狗：LED 渲染进程卡死！");
      watchdogTriggered = true;
    }
  }
  
  if (!printerOffline && lastModeJudgmentTime > 0 && currentMillis - lastModeJudgmentTime > watchdogTimeout) {
    Serial.println("看门狗：模式判断进程卡死！");
    watchdogTriggered = true;
  }
  
  if (ESP.getFreeHeap() < 300) {
    Serial.println("看门狗：堆内存低于 300 字节（剩余 " + String(ESP.getFreeHeap()) + "）！");
    watchdogTriggered = true;
  }
  
  if (watchdogTriggered) {
    Serial.println("看门狗触发！系统将重启。");
    ESP.restart();
  }
}

bool isConfigValid() {
  return strlen(uid) > 0 && strlen(accessToken) > 0 && strlen(deviceID) > 0;
}

bool isPrinting() {
  return (gcodeState == "RUNNING") || (remainingTime > 0) || (printPercent > 0) || (layerNum > 0);
}

void setup() {
  Serial.begin(115200);

  // 初始化 LED 灯带
  strip.begin();
  strip.setBrightness(globalBrightness);
  bool ledOk = true;
  for (int i = 0; i < LED_COUNT; i++) {
    strip.setPixelColor(i, strip.Color(255, 255, 255));
    strip.show();
    delay(10);
    strip.clear();
    strip.show();
    if (!strip.getPixelColor(i)) {
      Serial.println("LED 初始化失败，索引：" + String(i));
      ledOk = false;
    }
  }
  if (!ledOk) {
    Serial.println("LED 灯带初始化失败，继续运行");
  } else {
    Serial.println("LED 灯带初始化成功");
  }

  // 初始化 LittleFS
  if (!LittleFS.begin()) {
    Serial.println("无法挂载 LittleFS");
    return;
  }

  // 加载配置
  loadConfig();

  // 初始化静态 HTML
  initStaticHtml();

  // 配置 WiFiManager
  WiFiManagerParameter custom_uid("uid", "用户ID", uid, 32);
  WiFiManagerParameter custom_access_token("accessToken", "访问令牌", accessToken, 256);
  WiFiManagerParameter custom_device_id("deviceID", "设备序列号", deviceID, 32);
  wm.addParameter(&custom_uid);
  wm.addParameter(&custom_access_token);
  wm.addParameter(&custom_device_id);
  wm.setSaveConfigCallback(saveConfigCallback);
  wm.setAPCallback(configModeCallback);
  wm.setConfigPortalTimeout(180);

  // 尝试 WiFi 连接
  currentState = CONNECTING_WIFI;
  lastModeJudgmentTime = millis();
  if (!wm.autoConnect("BambuAP")) {
    Serial.println("WiFi 连接失败，进入 AP 模式");
    currentState = AP_MODE;
    lastModeJudgmentTime = millis();
  } else {
    Serial.println("WiFi 连接成功");
    currentState = CONNECTED_WIFI;
    lastModeJudgmentTime = millis();
    strncpy(uid, custom_uid.getValue(), sizeof(uid) - 1);
    uid[sizeof(uid) - 1] = '\0';
    strncpy(accessToken, custom_access_token.getValue(), sizeof(accessToken) - 1);
    accessToken[sizeof(accessToken) - 1] = '\0';
    strncpy(deviceID, custom_device_id.getValue(), sizeof(deviceID) - 1);
    deviceID[sizeof(deviceID) - 1] = '\0';
    saveConfig();

    // 与 NTP 同步时间
    configTime(0, 0, "pool.ntp.org");
    time_t now = time(nullptr);
    unsigned long start = millis();
    while (now < 1000000000 && millis() - start < 5000) {
      delay(500);
      now = time(nullptr);
    }
    if (now >= 1000000000) {
      Serial.println("时间同步成功");
    } else {
      Serial.println("NTP 同步失败，继续使用本地时间");
    }
  }

  // 配置 MQTT
  if (isConfigValid()) {
    espClient.setInsecure();
    mqttClient.setServer(mqttServer, mqttPort);
    mqttClient.setCallback(mqttCallback);
  } else {
    Serial.println("配置为空，跳过 MQTT 初始化");
    mqttError = "配置为空，请设置用户ID、访问令牌和设备序列号";
  }

  // 启动 Web 服务器
  server.on("/", handleRoot);
  server.on("/config", handleConfig);
  server.on("/testLed", handleTestLed);
  server.on("/log", handleLog);
  server.on("/clearCache", handleClearCache);
  server.on("/resetConfig", handleResetConfig);
  server.on("/switchMode", handleSwitchMode);
  server.onNotFound([]() { server.send(404, "text/plain", "页面不存在"); });
  server.begin();
  Serial.println("HTTP 服务器启动");

  // 初始化看门狗
  watchdogTicker.attach_ms(1000, watchdogCallback);
  lastWatchdogFeed = millis();
}

void loop() {
  unsigned long currentMillis = millis();

  // 监控关键进程
  if (currentMillis - lastOperationCheck > operationCheckInterval) {
    lastOperationCheck = currentMillis;
    if (WiFi.status() == WL_CONNECTED || currentState == AP_MODE) {
      lastWatchdogFeed = currentMillis;
    }
  }

  server.handleClient();

  // 检查 WiFi 状态
  if (currentState != AP_MODE && currentMillis - lastWiFiCheck > wifiCheckInterval) {
    lastWiFiCheck = currentMillis;
    if (WiFi.status() != WL_CONNECTED) {
      Serial.println("WiFi 断开，尝试重新连接");
      currentState = CONNECTING_WIFI;
      lastModeJudgmentTime = millis();
      wm.startConfigPortal("BambuAP");
      if (WiFi.status() == WL_CONNECTED) {
        currentState = CONNECTED_WIFI;
        lastModeJudgmentTime = millis();
        configTime(0, 0, "pool.ntp.org");
        time_t now = time(nullptr);
        unsigned long start = millis();
        while (now < 1000000000 && millis() - start < 5000) {
          delay(500);
          now = time(nullptr);
        }
        if (now >= 1000000000) {
          Serial.println("时间同步成功");
        } else {
          Serial.println("NTP 同步失败，继续使用本地时间");
        }
      } else {
        currentState = AP_MODE;
        lastModeJudgmentTime = millis();
      }
    }
  }

  // 处理 MQTT 连接
  if (currentState != AP_MODE && WiFi.status() == WL_CONNECTED && isConfigValid()) {
    if (!mqttClient.connected()) {
      currentState = CONNECTING_PRINTER;
      lastModeJudgmentTime = millis();
      reconnectMQTT();
    } else {
      mqttClient.loop();
      // 检查 MQTT 响应超时
      if (currentState == CONNECTED_PRINTER && currentMillis - lastMqttResponseTime > mqttResponseTimeout) {
        Serial.println("MQTT 响应超时，打印机可能离线，重新连接");
        printerOffline = true;
        currentState = CONNECTING_PRINTER;
        lastModeJudgmentTime = millis();
        mqttClient.disconnect();
      }
    }
  }

  // 定期发送 pushall
  if (!isWebServing && currentState == CONNECTED_PRINTER && currentMillis - lastPushallTime > customPushallInterval * 1000) {
    sendPushall();
    lastPushallTime = currentMillis;
  } else if (isWebServing && currentState == CONNECTED_PRINTER && currentMillis - lastPushallTime > customPushallInterval * 1000) {
    pendingPushall = true; // 标记需要发送全量包
  }

  // 处理 Web 客户端超时
  if (activeClientIP != IPAddress(0, 0, 0, 0) && currentMillis - activeClientTimeout > clientTimeoutInterval) {
    activeClientIP = IPAddress(0, 0, 0, 0);
    Serial.println("Web 客户端超时，释放锁定");
  }

  // 检查 Web 响应超时
  if (isWebServing && currentMillis - webResponseStartTime > webResponseTimeout) {
    Serial.println("Web 响应超时，系统将重启");
    ESP.restart();
  }

