RayGA17/Bambu-Progress-Bar/Esp8266/v3.2.cpp
  server.setContentLength(html.length());
  server.send(200, "text/html; charset=utf-8", "");
  server.client().write(html.c_str(), html.length());

  isWebServing = false;
  pauseLedUpdate = false;
  if (pendingPushall) {
    sendPushall();
    pendingPushall = false;
  }
}

void handleConfig() {
  if (!checkClientAccess()) {
    server.send(403, "text/html", "<h1>访问被拒绝</h1><p>另一个设备正在配置。</p>");
    return;
  }

  isWebServing = true;
  webResponseStartTime = millis();

  if (server.hasArg("uid") && server.hasArg("accessToken") && server.hasArg("deviceID")) {
    String newUid = server.arg("uid");
    String newAccessToken = server.arg("accessToken");
    String newDeviceID = server.arg("deviceID");
    int newBrightness = server.arg("brightness").toInt();
    String newStandbyMode = server.arg("standbyMode");
    String newProgressBarColor = server.arg("progressBarColor");
    String newStandbyBreathingColor = server.arg("standbyBreathingColor");
    float newPbr = server.arg("progressBarBrightnessRatio").toFloat();
    float newSbr = server.arg("standbyBrightnessRatio").toFloat();
    int newPushallInterval = server.arg("customPushallInterval").toInt();
    bool newOverlayMarquee = server.hasArg("overlayMarquee") && server.arg("overlayMarquee") == "on";

    // 服务器端验证
    if (newUid.length() == 0 || newAccessToken.length() == 0 || newDeviceID.length() == 0) {
      String response = "<script>alert('用户ID、访问令牌和设备序列号不能为空！'); window.location.href='/';</script>";
      server.send(400, "text/html; charset=utf-8", response);
      isWebServing = false;
      return;
    }
    if (newBrightness < 0 || newBrightness > 255) {
      String response = "<script>alert('全局亮度必须在 0 到 255 之间！'); window.location.href='/';</script>";
      server.send(400, "text/html; charset=utf-8", response);
      isWebServing = false;
      return;
    }
    if (newStandbyMode != "marquee" && newStandbyMode != "breathing") {
      String response = "<script>alert('无效的待机模式！'); window.location.href='/';</script>";
      server.send(400, "text/html; charset=utf-8", response);
      isWebServing = false;
      return;
    }
    if (!newProgressBarColor.startsWith("#") || newProgressBarColor.length() != 7) {
      String response = "<script>alert('进度条颜色必须是 6 位十六进制！'); window.location.href='/';</script>";
      server.send(400, "text/html; charset=utf-8", response);
      isWebServing = false;
      return;
    }
    if (!newStandbyBreathingColor.startsWith("#") || newStandbyBreathingColor.length() != 7) {
      String response = "<script>alert('待机呼吸灯颜色必须是 6 位十六进制！'); window.location.href='/';</script>";
      server.send(400, "text/html; charset=utf-8", response);
      isWebServing = false;
      return;
    }
    if (newPbr < 0.0 || newPbr > 1.0 || newSbr < 0.0 || newSbr > 1.0) {
      String response = "<script>alert('亮度比例必须在 0 到 1 之间！'); window.location.href='/';</script>";
      server.send(400, "text/html; charset=utf-8", response);
      isWebServing = false;
      return;
    }
    if (newPushallInterval < 10 || newPushallInterval > 600) {
      String response = "<script>alert('全量包请求间隔必须在 10 到 600 秒之间！'); window.location.href='/';</script>";
      server.send(400, "text/html; charset=utf-8", response);
      isWebServing = false;
      return;
    }

    strncpy(uid, newUid.c_str(), sizeof(uid) - 1);
    uid[sizeof(uid) - 1] = '\0';
    strncpy(accessToken, newAccessToken.c_str(), sizeof(accessToken) - 1);
    accessToken[sizeof(accessToken) - 1] = '\0';
    strncpy(deviceID, newDeviceID.c_str(), sizeof(deviceID) - 1);
    deviceID[sizeof(deviceID) - 1] = '\0';
    globalBrightness = newBrightness;
    strncpy(standbyMode, newStandbyMode.c_str(), sizeof(standbyMode) - 1);
    standbyMode[sizeof(standbyMode) - 1] = '\0';
    overlayMarquee = newOverlayMarquee;
    progressBarColor = newProgressBarColor.substring(1).length() == 6 ? strtoul(newProgressBarColor.substring(1).c_str(), NULL, 16) : progressBarColor;
    standbyBreathingColor = newStandbyBreathingColor.substring(1).length() == 6 ? strtoul(newStandbyBreathingColor.substring(1).c_str(), NULL, 16) : standbyBreathingColor;
    progressBarBrightnessRatio = newPbr;
    standbyBrightnessRatio = newSbr;
    customPushallInterval = newPushallInterval;
    strip.setBrightness(constrain(globalBrightness, 0, 255));
    saveConfig();
    if (isConfigValid()) {
      mqttClient.setServer(mqttServer, mqttPort);
      currentState = CONNECTING_PRINTER;
      lastModeJudgmentTime = millis();
    }
    activeClientIP = IPAddress(0, 0, 0, 0);
    String response = "<script>alert('配置保存成功！'); window.location.href='/';</script>";
    server.send(200, "text/html; charset=utf-8", response);
  } else {
    String response = "<script>alert('缺少必要参数！'); window.location.href='/';</script>";
    server.send(400, "text/html; charset=utf-8", response);
  }
  isWebServing = false;
}

void handleTestLed() {
  if (!checkClientAccess()) {
    server.send(403, "text/html", "<h1>访问被拒绝</h1><p>另一个设备正在配置。</p>");
    return;
  }
  isWebServing = true;
  webResponseStartTime = millis();
  testingLed = true;
  testLedIndex = 0;
  lastTestLedUpdate = millis();
  String response = "<script>alert('开始测试 LED 灯带！'); window.location.href='/';</script>";
  server.send(200, "text/html; charset=utf-8", response);
  isWebServing = false;
}

void handleLog() {
  isWebServing = true;
  webResponseStartTime = millis();
  String ledMode;
  if (currentState == AP_MODE) {
    ledMode = apClientConnected ? "绿色常亮" : "黄绿交替";
  } else if (currentState == CONNECTING_WIFI || currentState == CONNECTING_PRINTER) {
    ledMode = "红蓝交替";
  } else if (currentState == CONNECTED_WIFI) {
    ledMode = "蓝色常亮，红色闪烁";
  } else if (currentState == CONNECTED_PRINTER || currentState == PRINTING) {
    if (currentState == PRINTING) {
      ledMode = "进度条（" + String(overlayMarquee ? "带彩虹跑马灯" : "纯色") + "）";
    } else {
      ledMode = String(standbyMode) == "marquee" ? "彩虹跑马灯" : "呼吸灯";
    }
  } else if (currentState == ERROR) {
    ledMode = "红色闪烁";
  }

